Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 30, 30, 15)        420       
_________________________________________________________________
batch_normalization (BatchNo (None, 30, 30, 15)        60        
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 15, 15, 15)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 13, 13, 75)        10200     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 5, 5, 75)          0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 3, 375)         253500    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 1, 1, 375)         0         
_________________________________________________________________
flatten (Flatten)            (None, 375)               0         
_________________________________________________________________
dense (Dense)                (None, 120)               45120     
_________________________________________________________________
dense_1 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_2 (Dense)              (None, 10)                850       
=================================================================
Total params: 320,314
Trainable params: 320,284
Non-trainable params: 30
_________________________________________________________________
Epoch 1/50
12500/12500 [==============================] - 55s 4ms/step - loss: 0.0823 - accuracy: 0.3211 - val_loss: 0.0711 - val_accuracy: 0.4798
Epoch 2/50
12500/12500 [==============================] - 55s 4ms/step - loss: 0.0698 - accuracy: 0.4851 - val_loss: 0.0650 - val_accuracy: 0.5309
Epoch 3/50
