Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 30, 30, 24)        672       
_________________________________________________________________
batch_normalization (BatchNo (None, 30, 30, 24)        96        
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 15, 15, 24)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 13, 13, 100)       21700     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 5, 5, 100)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 3, 400)         360400    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 1, 1, 400)         0         
_________________________________________________________________
flatten (Flatten)            (None, 400)               0         
_________________________________________________________________
dense (Dense)                (None, 120)               48120     
_________________________________________________________________
dense_1 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_2 (Dense)              (None, 10)                850       
=================================================================
Total params: 442,002
Trainable params: 441,954
Non-trainable params: 48
_________________________________________________________________
Epoch 1
loss: 0.0756 - accuracy: 0.4169 - val_loss: 0.0691 - val_accuracy: 0.4801
Epoch 2
loss: 0.0653 - accuracy: 0.5365 - val_loss: 0.0639 - val_accuracy: 0.5463
Epoch 3
loss: 0.0593 - accuracy: 0.5931 - val_loss: 0.0594 - val_accuracy: 0.5918
Epoch 4
loss: 0.0544 - accuracy: 0.6392 - val_loss: 0.0571 - val_accuracy: 0.6115
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 30, 30, 24)        672       
_________________________________________________________________
batch_normalization (BatchNo (None, 30, 30, 24)        96        
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 15, 15, 24)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 13, 13, 100)       21700     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 5, 5, 100)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 3, 400)         360400    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 1, 1, 400)         0         
_________________________________________________________________
flatten (Flatten)            (None, 400)               0         
_________________________________________________________________
dense (Dense)                (None, 120)               48120     
_________________________________________________________________
dense_1 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_2 (Dense)              (None, 10)                850       
=================================================================
Total params: 442,002
Trainable params: 441,954
Non-trainable params: 48
_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 30, 30, 24)        672       
_________________________________________________________________
batch_normalization (BatchNo (None, 30, 30, 24)        96        
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 15, 15, 24)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 13, 13, 100)       21700     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 5, 5, 100)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 3, 400)         360400    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 1, 1, 400)         0         
_________________________________________________________________
flatten (Flatten)            (None, 400)               0         
_________________________________________________________________
dense (Dense)                (None, 120)               48120     
_________________________________________________________________
dense_1 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_2 (Dense)              (None, 10)                850       
=================================================================
Total params: 442,002
Trainable params: 441,954
Non-trainable params: 48
_________________________________________________________________
Epoch 1
loss: 0.0765 - accuracy: 0.4067 - val_loss: 0.0689 - val_accuracy: 0.4908
Epoch 2
loss: 0.0662 - accuracy: 0.5284 - val_loss: 0.0629 - val_accuracy: 0.5576
Epoch 3
loss: 0.0600 - accuracy: 0.5859 - val_loss: 0.0589 - val_accuracy: 0.5946
Epoch 4
loss: 0.0550 - accuracy: 0.6296 - val_loss: 0.0561 - val_accuracy: 0.6176
Epoch 5
loss: 0.0508 - accuracy: 0.6643 - val_loss: 0.0553 - val_accuracy: 0.6145
Epoch 6
loss: 0.0472 - accuracy: 0.6974 - val_loss: 0.0531 - val_accuracy: 0.6342
Epoch 7
loss: 0.0441 - accuracy: 0.7235 - val_loss: 0.0521 - val_accuracy: 0.6458
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 30, 30, 24)        672       
_________________________________________________________________
batch_normalization (BatchNo (None, 30, 30, 24)        96        
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 15, 15, 24)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 13, 13, 100)       21700     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 5, 5, 100)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 3, 400)         360400    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 1, 1, 400)         0         
_________________________________________________________________
flatten (Flatten)            (None, 400)               0         
_________________________________________________________________
dense (Dense)                (None, 120)               48120     
_________________________________________________________________
dense_1 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_2 (Dense)              (None, 10)                850       
=================================================================
Total params: 442,002
Trainable params: 441,954
Non-trainable params: 48
_________________________________________________________________
Epoch 1
loss: 0.0770 - accuracy: 0.4081 - val_loss: 0.0704 - val_accuracy: 0.4985
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 30, 30, 25)        700       
_________________________________________________________________
batch_normalization (BatchNo (None, 30, 30, 25)        100       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 15, 15, 25)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 13, 13, 100)       22600     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 5, 5, 100)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 3, 400)         360400    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 1, 1, 400)         0         
_________________________________________________________________
flatten (Flatten)            (None, 400)               0         
_________________________________________________________________
dense (Dense)                (None, 120)               48120     
_________________________________________________________________
dense_1 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_2 (Dense)              (None, 10)                850       
=================================================================
Total params: 442,934
Trainable params: 442,884
Non-trainable params: 50
_________________________________________________________________
Epoch 1
loss: 0.0763 - accuracy: 0.4137 - val_loss: 0.0706 - val_accuracy: 0.4893
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 30, 30, 30)        840       
_________________________________________________________________
batch_normalization (BatchNo (None, 30, 30, 30)        120       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 15, 15, 30)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 13, 13, 100)       27100     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 5, 5, 100)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 3, 400)         360400    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 1, 1, 400)         0         
_________________________________________________________________
flatten (Flatten)            (None, 400)               0         
_________________________________________________________________
dense (Dense)                (None, 120)               48120     
_________________________________________________________________
dense_1 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_2 (Dense)              (None, 10)                850       
=================================================================
Total params: 447,594
Trainable params: 447,534
Non-trainable params: 60
_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 30, 30, 24)        672       
_________________________________________________________________
batch_normalization (BatchNo (None, 30, 30, 24)        96        
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 15, 15, 24)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 13, 13, 192)       41664     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 5, 5, 192)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 3, 1536)        2655744   
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 1, 1, 1536)        0         
_________________________________________________________________
flatten (Flatten)            (None, 1536)              0         
_________________________________________________________________
dense (Dense)                (None, 800)               1229600   
_________________________________________________________________
dense_1 (Dense)              (None, 400)               320400    
_________________________________________________________________
dense_2 (Dense)              (None, 120)               48120     
_________________________________________________________________
dense_3 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_4 (Dense)              (None, 10)                850       
=================================================================
Total params: 4,307,310
Trainable params: 4,307,262
Non-trainable params: 48
_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 30, 30, 30)        840       
_________________________________________________________________
batch_normalization (BatchNo (None, 30, 30, 30)        120       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 15, 15, 30)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 13, 13, 300)       81300     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 5, 5, 300)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 3, 3000)        8103000   
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 1, 1, 3000)        0         
_________________________________________________________________
flatten (Flatten)            (None, 3000)              0         
_________________________________________________________________
dense (Dense)                (None, 1500)              4501500   
_________________________________________________________________
dense_1 (Dense)              (None, 800)               1200800   
_________________________________________________________________
dense_2 (Dense)              (None, 400)               320400    
_________________________________________________________________
dense_3 (Dense)              (None, 120)               48120     
_________________________________________________________________
dense_4 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_5 (Dense)              (None, 10)                850       
=================================================================
Total params: 14,267,094
Trainable params: 14,267,034
Non-trainable params: 60
_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 30, 30, 30)        840       
_________________________________________________________________
batch_normalization (BatchNo (None, 30, 30, 30)        120       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 15, 15, 30)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 13, 13, 300)       81300     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 5, 5, 300)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 3, 2500)        6752500   
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 1, 1, 2500)        0         
_________________________________________________________________
flatten (Flatten)            (None, 2500)              0         
_________________________________________________________________
dense (Dense)                (None, 1500)              3751500   
_________________________________________________________________
dense_1 (Dense)              (None, 800)               1200800   
_________________________________________________________________
dense_2 (Dense)              (None, 400)               320400    
_________________________________________________________________
dense_3 (Dense)              (None, 120)               48120     
_________________________________________________________________
dense_4 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_5 (Dense)              (None, 10)                850       
=================================================================
Total params: 12,166,594
Trainable params: 12,166,534
Non-trainable params: 60
_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 30, 30, 30)        840       
_________________________________________________________________
batch_normalization (BatchNo (None, 30, 30, 30)        120       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 15, 15, 30)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 13, 13, 300)       81300     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 5, 5, 300)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 3, 2000)        5402000   
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 1, 1, 2000)        0         
_________________________________________________________________
flatten (Flatten)            (None, 2000)              0         
_________________________________________________________________
dense (Dense)                (None, 1500)              3001500   
_________________________________________________________________
dense_1 (Dense)              (None, 800)               1200800   
_________________________________________________________________
dense_2 (Dense)              (None, 400)               320400    
_________________________________________________________________
dense_3 (Dense)              (None, 120)               48120     
_________________________________________________________________
dense_4 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_5 (Dense)              (None, 10)                850       
=================================================================
Total params: 10,066,094
Trainable params: 10,066,034
Non-trainable params: 60
_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 30, 30, 30)        840       
_________________________________________________________________
batch_normalization (BatchNo (None, 30, 30, 30)        120       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 15, 15, 30)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 13, 13, 300)       81300     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 5, 5, 300)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 3, 2500)        6752500   
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 1, 1, 2500)        0         
_________________________________________________________________
flatten (Flatten)            (None, 2500)              0         
_________________________________________________________________
dense (Dense)                (None, 1500)              3751500   
_________________________________________________________________
dense_1 (Dense)              (None, 800)               1200800   
_________________________________________________________________
dense_2 (Dense)              (None, 400)               320400    
_________________________________________________________________
dense_3 (Dense)              (None, 120)               48120     
_________________________________________________________________
dense_4 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_5 (Dense)              (None, 10)                850       
=================================================================
Total params: 12,166,594
Trainable params: 12,166,534
Non-trainable params: 60
_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 30, 30, 30)        840       
_________________________________________________________________
batch_normalization (BatchNo (None, 30, 30, 30)        120       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 15, 15, 30)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 13, 13, 300)       81300     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 5, 5, 300)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 3, 2750)        7427750   
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 1, 1, 2750)        0         
_________________________________________________________________
flatten (Flatten)            (None, 2750)              0         
_________________________________________________________________
dense (Dense)                (None, 1500)              4126500   
_________________________________________________________________
dense_1 (Dense)              (None, 800)               1200800   
_________________________________________________________________
dense_2 (Dense)              (None, 400)               320400    
_________________________________________________________________
dense_3 (Dense)              (None, 120)               48120     
_________________________________________________________________
dense_4 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_5 (Dense)              (None, 10)                850       
=================================================================
Total params: 13,216,844
Trainable params: 13,216,784
Non-trainable params: 60
_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 30, 30, 30)        840       
_________________________________________________________________
batch_normalization (BatchNo (None, 30, 30, 30)        120       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 15, 15, 30)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 13, 13, 300)       81300     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 5, 5, 300)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 3, 3000)        8103000   
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 1, 1, 3000)        0         
_________________________________________________________________
flatten (Flatten)            (None, 3000)              0         
_________________________________________________________________
dense (Dense)                (None, 1500)              4501500   
_________________________________________________________________
dense_1 (Dense)              (None, 800)               1200800   
_________________________________________________________________
dense_2 (Dense)              (None, 400)               320400    
_________________________________________________________________
dense_3 (Dense)              (None, 120)               48120     
_________________________________________________________________
dense_4 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_5 (Dense)              (None, 10)                850       
=================================================================
Total params: 14,267,094
Trainable params: 14,267,034
Non-trainable params: 60
_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 30, 30, 30)        840       
_________________________________________________________________
batch_normalization (BatchNo (None, 30, 30, 30)        120       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 15, 15, 30)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 13, 13, 300)       81300     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 5, 5, 300)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 3, 3000)        8103000   
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 1, 1, 3000)        0         
_________________________________________________________________
flatten (Flatten)            (None, 3000)              0         
_________________________________________________________________
dense (Dense)                (None, 1600)              4801600   
_________________________________________________________________
dense_1 (Dense)              (None, 800)               1280800   
_________________________________________________________________
dense_2 (Dense)              (None, 400)               320400    
_________________________________________________________________
dense_3 (Dense)              (None, 120)               48120     
_________________________________________________________________
dense_4 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_5 (Dense)              (None, 10)                850       
=================================================================
Total params: 14,647,194
Trainable params: 14,647,134
Non-trainable params: 60
_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 30, 30, 33)        924       
_________________________________________________________________
batch_normalization (BatchNo (None, 30, 30, 33)        132       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 15, 15, 33)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 13, 13, 333)       99234     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 5, 5, 333)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 3, 3333)        9992334   
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 1, 1, 3333)        0         
_________________________________________________________________
flatten (Flatten)            (None, 3333)              0         
_________________________________________________________________
dense (Dense)                (None, 1600)              5334400   
_________________________________________________________________
dense_1 (Dense)              (None, 800)               1280800   
_________________________________________________________________
dense_2 (Dense)              (None, 400)               320400    
_________________________________________________________________
dense_3 (Dense)              (None, 120)               48120     
_________________________________________________________________
dense_4 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_5 (Dense)              (None, 10)                850       
=================================================================
Total params: 17,087,358
Trainable params: 17,087,292
Non-trainable params: 66
_________________________________________________________________
Epoch 1
loss: 0.0716 - accuracy: 0.4530 - val_loss: 0.0611 - val_accuracy: 0.5547
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 30, 30, 33)        924       
_________________________________________________________________
batch_normalization (BatchNo (None, 30, 30, 33)        132       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 15, 15, 33)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 13, 13, 333)       99234     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 5, 5, 333)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 3, 3333)        9992334   
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 1, 1, 3333)        0         
_________________________________________________________________
flatten (Flatten)            (None, 3333)              0         
_________________________________________________________________
dense (Dense)                (None, 1600)              5334400   
_________________________________________________________________
dense_1 (Dense)              (None, 800)               1280800   
_________________________________________________________________
dense_2 (Dense)              (None, 400)               320400    
_________________________________________________________________
dense_3 (Dense)              (None, 120)               48120     
_________________________________________________________________
dense_4 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_5 (Dense)              (None, 10)                850       
=================================================================
Total params: 17,087,358
Trainable params: 17,087,292
Non-trainable params: 66
_________________________________________________________________
Epoch 1
loss: 0.0728 - accuracy: 0.4399 - val_loss: 0.0623 - val_accuracy: 0.5541
Epoch 2
loss: 0.0581 - accuracy: 0.5878 - val_loss: 0.0545 - val_accuracy: 0.6171
